app/Controllers/ControladorLibros.php

SELECT *
FROM `libros`
---
    public function inicioSecre()
    {
        $datos['cabecera'] = view('templates/encabezado2.php');
        $datos['pie'] = view('templates/pie.php');

        $objLibro=new ModeloLibros();

        $datos['libros']=$objLibro->findAll();

SELECT *
FROM `libros`
---
    public function ListarLibros(){

        $datos['cabecera']=view('/templates/encabezado.php');
        $datos['pie']=view('/templates/pie.php');

        $objLibro=new ModeloLibros();

        $datos['libros']=$objLibro->findAll();

INSERT INTO `libros` (`titulo`, `autor`) VALUES ('Fisica 1', 'Luis')
---
    public function ingresar(){
        $datos=[
                    "titulo"=>$_POST['titulo'],
                    "autor"=>$_POST['autor'],
        ];
        $objLibro=new ModeloLibros();
        $respuesta = $objLibro->insert($datos);