app/Models/ModeloLogin.php

    public function validarUsuario($user, $pass){
        $db = \Config\Database::connect();
        $builder = $db->table('tbllogin');
        $builder->where('user', $user);
        $builder->where('pass', $pass);
        $
        $query = $builder->get();
---
SELECT *
FROM `tbllogin`
WHERE `user` = 'secre'